In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [12]:
data = pd.read_csv("penguins_size.csv")
cols = ["species","culmen_length_mm", "culmen_depth_mm", "flipper_length_mm", "body_mass_g"]

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   culmen_length_mm   342 non-null    float64
 3   culmen_depth_mm    342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                334 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [4]:
data.describe()

       culmen_length_mm  culmen_depth_mm  flipper_length_mm  body_mass_g
count        342.000000       342.000000         342.000000   342.000000
mean          43.921930        17.151170         200.915205  4201.754386
std            5.459584         1.974793          14.061714   801.954536
min           32.100000        13.100000         172.000000  2700.000000
25%           39.225000        15.600000         190.000000  3550.000000
50%           44.450000        17.300000         197.000000  4050.000000
75%           48.500000        18.700000         213.000000  4750.000000
max           59.600000        21.500000         231.000000  6300.000000

In [5]:
data.head(10)

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE
6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,FEMALE
7,Adelie,Torgersen,39.2,19.6,195.0,4675.0,MALE
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN

## Gestire i valorin mancanti (NaN)

In [10]:
dataNoNaN = data.dropna() #Rimossi tutti i record con almeno un NaN
dataNoNaN.head(10)

#data.dropna(inplace = True) toglie i NaN dal dataframe originale

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE
6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,FEMALE
7,Adelie,Torgersen,39.2,19.6,195.0,4675.0,MALE
12,Adelie,Torgersen,41.1,17.6,182.0,3200.0,FEMALE
13,Adelie,Torgersen,38.6,21.2,191.0,3800.0,MALE
14,Adelie,Torgersen,34.6,21.1,198.0,4400.0,MALE

In [14]:
sel_data = data[cols].dropna()
sel_data

    species  culmen_length_mm  culmen_depth_mm  flipper_length_mm  body_mass_g
0    Adelie              39.1             18.7              181.0       3750.0
1    Adelie              39.5             17.4              186.0       3800.0
2    Adelie              40.3             18.0              195.0       3250.0
4    Adelie              36.7             19.3              193.0       3450.0
5    Adelie              39.3             20.6              190.0       3650.0
..      ...               ...              ...                ...          ...
338  Gentoo              47.2             13.7              214.0       4925.0
340  Gentoo              46.8             14.3              215.0       4850.0
341  Gentoo              50.4             15.7              222.0       5750.0
342  Gentoo              45.2             14.8              212.0       5200.0
343  Gentoo              49.9             16.1              213.0       5400.0

[342 rows x 5 columns]

In [15]:
sel_data[(sel_data["species"] == "Adelie") & (sel_data["body_mass_g"] < 4000)]

    species  culmen_length_mm  culmen_depth_mm  flipper_length_mm  body_mass_g
0    Adelie              39.1             18.7              181.0       3750.0
1    Adelie              39.5             17.4              186.0       3800.0
2    Adelie              40.3             18.0              195.0       3250.0
4    Adelie              36.7             19.3              193.0       3450.0
5    Adelie              39.3             20.6              190.0       3650.0
..      ...               ...              ...                ...          ...
145  Adelie              39.0             18.7              185.0       3650.0
147  Adelie              36.6             18.4              184.0       3475.0
148  Adelie              36.0             17.8              195.0       3450.0
149  Adelie              37.8             18.1              193.0       3750.0
150  Adelie              36.0             17.1              187.0       3700.0

[112 rows x 5 columns]

In [16]:
sel_data["body_mass_kg"] = sel_data["body_mass_g"] / 1000.
sel_data.head(5)

,species,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,body_mass_kg
0,Adelie,39.1,18.7,181.0,3750.0,3.75
1,Adelie,39.5,17.4,186.0,3800.0,3.80
2,Adelie,40.3,18.0,195.0,3250.0,3.25
4,Adelie,36.7,19.3,193.0,3450.0,3.45
5,Adelie,39.3,20.6,190.0,3650.0,3.65

In [20]:
# cols = ["species","culmen_length_mm", "culmen_depth_mm", "flipper_length_mm", "body_mass_g"]
sel_data["body_mass_kg"].to_numpy()

sel_data[["species", "body_mass_kg"]].groupby("species").mean()

           body_mass_kg
species
Adelie         3.700662
Chinstrap      3.733088
Gentoo         5.076016

In [22]:
#peso medio pinguini agregate per specie e sesso
data[["species", "body_mass_g", "sex"]].groupby(["species","sex"]).mean()
data[["species", "body_mass_g", "sex"]].groupby(["species","sex"]).count()

                  body_mass_g
species   sex
Adelie    FEMALE           73
          MALE             73
Chinstrap FEMALE           34
          MALE             34
Gentoo    FEMALE           59
          MALE             61